package messages

const (
	DoneSet   = "✅"
	AddSet    = "➕"
	RemoveSet = "➖️"
	Timer     = "⏱️"

	Minutes = "⌛ Минуты"
	Reps    = "± Повторения"
	Weight  = "⚖️ Вес"
	Meters  = "📐 Метры"

	Technique  = "🧐 Техника"
	EndWorkout = "🏁 Завершить все"

	Prev         = "⬅️"
	Progress     = "📊"
	DropExercise = "🗑️"
	Next         = "➡️"

	Statistics  = "📊 <b>Статистика</b>"
	WorkoutTime = "⏱️ <b>Время</b>"
	WorkoutDate = "📅 <b>Дата:</b>"
	Summary     = "📈 <b>Итого</b>"

	EndsWorkouts       = "✅ Завершено тренировок"
	AvgWorkoutTime     = "⏱️ Среднее время тренировки"
	OverallWorkoutTime = "🫀 Общее время кардио"

	StatisticsWeek  = "📅 <b>Статистика за неделю</b>"
	StatisticsMonth = "📅 <b>Статистика за месяц</b>"
	StatisticsAll   = "📅 <b>Статистика общая</b>"

	EnterNewReps        = "± <b>Введите новое число повторений:</b>"
	EnterNewWeight      = "⚖️ <b>Введите новый вес (в кг):</b>"
	EnterNewTime        = "⌛ <b>Введите новое время (мин):</b>"
	EnterNewMeters      = "📐 <b>Введите новую дистанцию (метры):</b>"
	EnterWorkoutDayName = "<b>Введите имя тренировочного дня:</b>"
	EnterNewProgramName = "<b>Введите новое имя программы:</b>"
	EnterPreset         = "<b>Введите пресет в формате: <i><u>17*100,15*160,12*200</u></i> (17 повторений по 100 кг, ...)</b>"
	SelectGroupOfMuscle = "<b>Выберите группу мышц:</b>"

	RestTimer = "⏳ Таймер отдыха: %d секунд\n\n Расслабьтесь и подготовьтесь к следующему подходу!"
)
