package messages

const (
	Hello = "" +
		"🏋️‍♂️ *Добро пожаловать в Бот для тренировок!* \n\n" +
		"Выберите действие:"

	BackToMenu   = "🔙 В меню"
	StartWorkout = "▶️ Начать тренировку"
	MyWorkouts   = "📋 Мои тренировки"
	Stats        = "📊 Статистика"
	Settings     = "⚙️ Настройки"
	HowToUse     = "❓ Как пользоваться?"
	Admin        = "👨🏻‍💻 Админка"
	Users        = "👥 Пользователи"

	DoneSet   = "✅"
	AddSet    = "➕"
	RemoveSet = "➖️"
	Timer     = "⏱️"

	Minutes = "⌛ Минуты"
	Reps    = "± Повторения"
	Weight  = "⚖️ Вес"
	Meters  = "📐 Метры"

	Technique  = "🧐 Техника"
	EndWorkout = "🏁 Завершить все"

	Prev         = "⬅️"
	Progress     = "🏆 ︎"
	DropExercise = "🗑️"
	Next         = "➡️"

	WorkoutStats = "📊 <b>Статистика</b>"
	WorkoutTime  = "⏱️ <b>Время</b>"
	WorkoutDate  = "📅 <b>Дата:</b>"
	Summary      = "📈 <b>Итого</b>"

	EndsWorkouts       = "✅ Завершено тренировок"
	AvgWorkoutTime     = "⏱️ Среднее время тренировки"
	OverallWorkoutTime = "🫀 Общее время кардио"

	StatisticsWeek  = "📅 <b>Статистика за неделю</b>"
	StatisticsMonth = "📅 <b>Статистика за месяц</b>"
	StatisticsAll   = "📅 <b>Статистика общая</b>"

	EnterNewReps        = "± <b>Введите новое число повторений:</b>"
	EnterNewWeight      = "⚖️ <b>Введите новый вес (в кг):</b>"
	EnterNewTime        = "⌛ <b>Введите новое время (мин):</b>"
	EnterNewMeters      = "📐 <b>Введите новую дистанцию (метры):</b>"
	EnterWorkoutDayName = "<b>Введите имя тренировочного дня:</b>"
	EnterNewProgramName = "<b>Введите новое имя программы:</b>"
	EnterPreset         = "<b>Введите пресет в одном из следующих форматов:</b>" +
		"\n\n• <u><b>reps,weight:17*100,15*160,12*200</b></u> — <i>что означает 3 подхода: первый - 17 повторений по 100 кг, второй - 15 повторений на 160 кг, а третий - 12 повторений на 200 кг</i>" +
		"\n\n• <u><b>minutes:15,10</b></u> — <i>что означает два подхода по 15 и 10 минут</i>" +
		"\n\n• <u><b>meters:100</b></u> — <i>что означает один подход на 100 метров (например, бассейн)</i>"
	SelectGroupOfMuscle = "<b>Выберите группу мышц:</b>"

	RestNotSupported = "У этого упражнения не предусмотрен отдых! 😐"
	TimerCanceled    = "Таймер отменен! 🗿"
	CancelTimer      = "🚫 Отменить"
	RestTimer        = "" +
		"⏳ Таймер отдыха: <b>%d секунд</b>\n\n" +
		"Расслабьтесь и подготовьтесь к следующему подходу!"
	RestIsEnded = "🔔 <b>Время отдыха закончилось!</b>\n\n" +
		"Приступайте к следующему подходу! 💪"

	YouCannotDeleteOneOfSet = "Нельзя удалить единственный подход 🗿. Вы можете удалить упражнение целиком кликом на 🗑"
	SetDeleted              = "✅ <b>Подход удален!</b>"
	SetAdded                = "✅ <b>Еще один подход добавлен!</b>"
	SetCompleted            = "✅ <b>Подход завершен!</b>"
)
